import tkinter as tk  # Імпортуємо бібліотеку Tkinter

# Створюємо головне вікно
root = tk.Tk()

# Налаштування головного вікна
root.title("Моє перше вікно")  # Задаємо заголовок вікна
root.geometry("300x200")  # Задаємо розміри вікна (ширина x висота)

# Функція для обробки натискання кнопки
def on_button_click():
    print("Кнопка натиснута!")

# Створюємо кнопку
button = tk.Button(root, text="Натисни мене", command=on_button_click)  # Створюємо кнопку
button.pack()  # Додаємо кнопку в вікно

# Запускаємо головний цикл програми
root.mainloop()
