import sqlite3
from datetime import datetime

# Створення підключення до бази даних (створюється файл, якщо його немає)
conn = sqlite3.connect('bd.bd')
cursor = conn.cursor()

# Створення таблиці, якщо вона ще не існує
cursor.execute('''
CREATE TABLE IF NOT EXISTS clients (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    last_name TEXT,
    first_name TEXT,
    middle_name TEXT,
    gender TEXT,
    birth_date TEXT
)
''')

# Дані для вставки (10 клієнтів)
clients_data = [
    ("Іванов", "Іван", "Іванович", "Чоловік", "1990-01-01"),
    ("Петров", "Петро", "Петрович", "Чоловік", "1991-02-01"),
    ("Сидоров", "Сидір", "Сидорович", "Чоловік", "1992-03-01"),
    ("Коваленко", "Ольга", "Миколаївна", "Жінка", "1988-04-15"),
    ("Марченко", "Тетяна", "Володимирівна", "Жінка", "1993-07-20"),
    ("Шевченко", "Андрій", "Тарасович", "Чоловік", "1985-11-11"),
    ("Довженко", "Олександр", "Іванович", "Чоловік", "1982-03-03"),
    ("Кучер", "Людмила", "Євгенівна", "Жінка", "1990-09-30"),
    ("Зеленський", "Володимир", "Олександрович", "Чоловік", "1978-01-25"),
    ("Руденко", "Ірина", "Вікторівна", "Жінка", "1995-12-12")
]

# Вставка даних про клієнтів в таблицю
cursor.executemany('''
INSERT INTO clients (last_name, first_name, middle_name, gender, birth_date)
VALUES (?, ?, ?, ?, ?)
''', clients_data)

# Збереження змін і закриття з'єднання
conn.commit()
conn.close()

print("База даних та таблиця успішно створені, і клієнти додані.")
